[
  {
    "version": "1.1.0",
    "date": "2025-11-07",
    "title": "Боевые Искусства",
    "description": "Наш справочник ДАТА-ПУЛ обнаружил лишние очки навыков, и решил их вкинуть... в БОЕВЫЕ ИСКУССТВА!",
    "changes": [
      "Добавлены Боевые Искусства - новый раздел, доступный с главной страницы",
      "Обновление лого в сайдбаре"
    ],
    "type": "major"
  },
  {
    "version": "1.2.0",
    "date": "2025-11-11",
    "title": "SEGOTARI POWER",
    "description": "Дополнение \"Segotari power\" добавлено на сайт",
    "changes": [
      "В раздел \"Товары для Дома\" добавлена информация из DLC SEGOTARI POWER",
      "Обновление раздела \"Снаряжение\", добавлены оборудование и софт из DLC SEGOTARI POWER",
      "Добавление страницы \"Остальное\" для Боевых Искусств на вырост. Пока на БИ оставлен переход с главной"
    ],
    "type": "major"
  },
  {
    "version": "1.3.0",
    "date": "2025-11-20",
    "title": "Ширма Мастера",
    "description": "А знаете что? Правильно. Мы навалили комфорта.",
    "changes": [
      "Вы смотрите прямо сейчас на эту новую фичу. Да, это блок новостей!",
      "Новая вкладка с Ширмой Мастера позволит вам с комфортом иметь блиц подсказку прямо на вашем экране без поиска по всем темам",
      "Новый функционал глобальных вкладок",
      "Изменение стилей заголовков на всех страницах",
      "Удаление иконки из заголовка страницы \"Одежда и Стиль\"",
      "Исправление опечаток: Название раздела на странице \"Гараж\"",
      "Исправление опечаток: Опечатка в таблице страницы \"Экзоскелеты/Боргирование\"",
      "Улучшение верстки страницы \"Поддержка и Обратная Связь\"",
      "Микроскопическое улучшение верстки страницы \"Таблицы Боя\""
    ],
    "type": "major"
  },
  {
    "version": "1.3.2",
    "date": "2025-12-09",
    "title": "Небольшие улучшения",
    "description": "Продолжаем улучшать жизнь.",
    "changes": [
      "Добавлена кнопка перехода к списку всех новостей на главной странице",
      "Добавлена фильтрация новостей на главной странице, чтобы показывать только \"мажорные\" изменения",
      "В разделах \"FAQ\", \"Поддержка и Обратная Связь\" и \"Благодарим за поддержку!\" добавлена кнопка перехода на главную страницу",
      "Исправление опечаток: Описание приема на странице \"Боевые Искусства\""
    ],
    "type": "minor"
  }
]
